PREFIX rdfs: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX pr:<http://dbpedia.org/ontology/>

#   A1. Dame todas las propiedades aplicables a las instancias de la clase Politician (http://dbpedia.org/ontology/Politician)

SELECT ?p WHERE { ?x a pr:Politician. ?x ?p ?y. }

#   A2. Dame todas las propiedades, exceptuando rdf:type, aplicables a las instancias de la clase Politician (http://dbpedia.org/ontology/Politician)

SELECT ?p WHERE { ?x a pr:Politician. ?x ?p ?y. FILTER ( ?p != rdfs:type ) }

#   A3. ¿Cuántos valores distintos se pueden encontrar para las propiedades, exceptuando rdf:type, de las instancias de la clase Politician (http://dbpedia.org/ontology/Politician)?

SELECT COUNT(DISTINCT ?p) as ?Count WHERE { ?x a pr:Politician. ?x ?p ?y FILTER ( ?p != rdfs:type ) }

#   A4. Para cada una de las propiedades, exceptuando rdf:type, aplicables a las instancias de la clase Politician (http://dbpedia.org/ontology/Politician), dime cuántos valores distintos toman en dichas instancias

SELECT DISTINCT ?p COUNT(?y) WHERE { ?x a pr:Politician. ?x ?p ?y FILTER ( ?p != rdfs:type ) }

#   A5. Para cada una de las propiedades, exceptuando rdf:type, aplicables a las instancias de la clase Politician (http://dbpedia.org/ontology/Politician), dime la media de valores distintos que toman en dichas instancias.

SELECT DISTINCT ?p AVG(?count) WHERE{ SELECT ?p COUNT(?y) as ?count WHERE { ?x a pr:Politician. ?x ?p ?y FILTER ( ?p != rdfs:type ) } }

#   A6. Para cada una de las propiedades, exceptuando rdf:type, aplicables a las instancias de la clase Politician (http://dbpedia.org/ontology/Politician), dime el máximo número de valores distintos que toman entre todas sus instancias, ordenado de mayor a menor

SELECT ?p MAX(?count) as ?m WHERE{ SELECT ?p COUNT(DISTINCT ?y) as ?count WHERE { ?x a pr:Politician. ?x ?p ?y FILTER ( ?p != rdfs:type ) } } ORDER BY DESC(?m)